In [15]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [4]:
#now we fill mode in categorical Data
dataset = pd.read_csv(r"D:\\DataScience\\seaborn-data-master\\tipps.csv")
dataset.head(4)

   total_bill   tip Gender smoker  day    time  size
0         NaN  1.01    NaN     No  NaN  Dinner   NaN
1         NaN  1.66    NaN     No  NaN  Dinner   NaN
2         NaN  3.50    NaN     No  NaN  Dinner   NaN
3         NaN  3.31    NaN     No  NaN  Dinner   NaN

In [5]:
dataset.isnull().sum()

total_bill    10
tip            0
Gender        10
smoker         0
day           10
time           0
size          10
dtype: int64

In [6]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  234 non-null    float64
 1   tip         244 non-null    float64
 2   Gender      234 non-null    object
 3   smoker      244 non-null    object
 4   day         234 non-null    object
 5   time        244 non-null    object
 6   size        234 non-null    float64
dtypes: float64(3), object(4)
memory usage: 13.5+ KB

In [7]:
dataset.select_dtypes(include="float64")

     total_bill   tip  size
0           NaN  1.01   NaN
1           NaN  1.66   NaN
2           NaN  3.50   NaN
3           NaN  3.31   NaN
4           NaN  3.61   NaN
..          ...   ...   ...
239         NaN  5.92   NaN
240         NaN  2.00   NaN
241         NaN  2.00   NaN
242         NaN  1.75   NaN
243         NaN  3.00   NaN

[244 rows x 3 columns]

In [8]:
dataset.select_dtypes(include="float64").columns

Index(['total_bill', 'tip', 'size'], dtype='object')

In [14]:
from sklearn.impute import SimpleImputer

In [21]:
si=SimpleImputer(strategy="mean")
ar=si.fit_transform(dataset[['total_bill', 'tip', 'size']])

In [23]:
new_dataset=pd.DataFrame(ar,columns=dataset.select_dtypes(include="float64").columns)
new_dataset

     total_bill   tip     size
0     19.725128  1.01  2.57265
1     19.725128  1.66  2.57265
2     19.725128  3.50  2.57265
3     19.725128  3.31  2.57265
4     19.725128  3.61  2.57265
..          ...   ...      ...
239   19.725128  5.92  2.57265
240   19.725128  2.00  2.57265
241   19.725128  2.00  2.57265
242   19.725128  1.75  2.57265
243   19.725128  3.00  2.57265

[244 rows x 3 columns]

In [24]:
new_dataset.isnull().sum()

total_bill    0
tip           0
size          0
dtype: int64

In [25]:
dataset["total_bill"].mean()

19.725128205128208

In [ ]:
#So dataset column "total_bill" fill by mean value

In [ ]:
#i want to fill dataset column "total_bill" fill by median value

In [26]:
si=SimpleImputer(strategy="median")
ar=si.fit_transform(dataset[['total_bill', 'tip', 'size']])

In [27]:
new_dataset=pd.DataFrame(ar,columns=dataset.select_dtypes(include="float64").columns)
new_dataset

     total_bill   tip  size
0         17.49  1.01   2.0
1         17.49  1.66   2.0
2         17.49  3.50   2.0
3         17.49  3.31   2.0
4         17.49  3.61   2.0
..          ...   ...   ...
239       17.49  5.92   2.0
240       17.49  2.00   2.0
241       17.49  2.00   2.0
242       17.49  1.75   2.0
243       17.49  3.00   2.0

[244 rows x 3 columns]

In [29]:
dataset["total_bill"].median()

17.490000000000002